cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'starkandwayne/cf'
tap 'weaveworks/tap'
tap 'liamg/tfsec'

brew 'ansible'
brew 'ansible-lint'
brew 'awscli'
brew 'bash-completion'
brew 'curl'
brew 'coreutils'
brew 'gawk'
brew 'go'
brew 'docker-credential-helper-ecr'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'golang'
brew 'gradle'
brew 'hh'
brew 'hub'
brew 'istioctl'
brew 'jq'
brew 'kubernetes-cli'
brew 'kops'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'kube-ps1'
brew 'kubespy'
brew 'kustomize'
#brew 'mas'
brew 'mtr'
brew 'nmap'
brew 'node'
brew 'packer'
brew 'pipenv'
brew 'postgres'
brew 'pre-commit'
brew 'pv'
brew 'python'
brew 'spotify'
brew 'terraform-docs'
brew 'tfenv'
brew 'tflint'
brew 'tfsec'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'vim'

cask 'alfred'
cask 'dash'
cask 'docker'
cask 'google-chrome'
cask 'java'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
#cask 'vagrant'
#cask 'virtualbox'

#mas 'Microsoft OneNote', id: 784801555

