#cask_args appdir: '~/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'starkandwayne/cf'
tap 'weaveworks/tap'
tap 'liamg/tfsec'
tap 'rockymadden/rockymadden'

brew 'asdf'
brew 'ansible'
brew 'ansible-lint'
brew 'awscli'
brew 'bash-completion'
brew 'curl'
#brew 'docker'
#brew 'docker-compose'
brew 'coreutils'
brew 'gawk'
brew 'go'
brew 'docker-completion'
brew 'docker-credential-helper-ecr'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'golang'
brew 'gradle'
brew 'hh'
brew 'hub'
brew 'istioctl'
brew 'ical-buddy'
brew 'jq'
#brew 'java'
brew 'kubernetes-cli'
brew 'kops'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'kube-ps1'
brew 'kubespy'
brew 'kustomize'
#brew 'mas'
brew 'maven'
brew 'mtr'
brew 'netcat'
brew 'nmap'
brew 'node'
brew 'packer'
brew 'pipenv'
brew 'postgres'
brew 'pre-commit'
brew 'pv'
brew 'python'
#brew 'spotify'
brew 'rockymadden/rockymadden/slack-cli'
brew 'telnet'
brew 'terraform-docs'
brew 'terragrunt'
brew 'terraformer'
#brew 'tfenv'
brew 'tflint'
brew 'tfsec'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'vim'

cask 'alfred'
cask 'bitbar'
cask 'intellij-idea-ce'
cask 'dash'
cask 'docker'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'mysqlworkbench'
#cask 'java'
#cask 'adoptopenjdk8'
cask 'postman'
cask 'spotify'
cask 'slack'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask '1password'

#mas 'Microsoft OneNote', id: 784801555

